{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.3.1.1", "modelTopology": {"node": [{"name": "P", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "12288"}]}}}}, {"name": "kernels_imag", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "12288"}]}}}}, {"name": "F", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "12288"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "factors", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "3"}]}}}}, {"name": "kernels_real", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "12288"}]}}}}, {"name": "X", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "12288"}]}}}}, {"name": "module_apply_default/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "module_apply_default/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/zeros/shape_as_tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/strided_slice_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "module_apply_default/CiCPaint/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "8"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/sub_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/strided_slice_4/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/strided_slice_4/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/strided_slice_4/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/strided_slice_5/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/mul_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/strided_slice_6/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/Tile", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "4096"}, {"size": "8"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/Reshape_2/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "module_apply_default/CiCPaint/Reshape_3/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "module_apply_default/R2C3D/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/FloorMod/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout/BatchGatherND/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/strided_slice_4/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/zeros", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "module_apply_default/CiCReadout/BatchGatherND/concat_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Reshape", "op": "Reshape", "input": ["kernels_real", "module_apply_default/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Reshape_1", "op": "Reshape", "input": ["kernels_imag", "module_apply_default/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Reshape_2", "op": "Reshape", "input": ["X", "module_apply_default/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Reshape_3", "op": "Reshape", "input": ["P", "module_apply_default/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Reshape_4", "op": "Reshape", "input": ["F", "module_apply_default/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/strided_slice", "op": "StridedSlice", "input": ["factors", "module_apply_default/strided_slice/stack", "module_apply_default/strided_slice/stack_1", "module_apply_default/strided_slice/stack_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "module_apply_default/strided_slice_1", "op": "StridedSlice", "input": ["factors", "module_apply_default/strided_slice/stack_1", "module_apply_default/strided_slice_1/stack_1", "module_apply_default/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "module_apply_default/strided_slice_5", "op": "StridedSlice", "input": ["factors", "module_apply_default/strided_slice_1/stack_1", "module_apply_default/strided_slice_4/stack_1", "module_apply_default/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Complex", "op": "Complex", "input": ["module_apply_default/Reshape", "module_apply_default/Reshape_1"], "attr": {"Tout": {"type": "DT_COMPLEX64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul", "op": "Mul", "input": ["module_apply_default/Reshape_4", "module_apply_default/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/strided_slice_2", "op": "StridedSlice", "input": ["module_apply_default/Complex", "module_apply_default/strided_slice/stack", "module_apply_default/strided_slice/stack_1", "module_apply_default/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/strided_slice_3", "op": "StridedSlice", "input": ["module_apply_default/Complex", "module_apply_default/strided_slice/stack_1", "module_apply_default/strided_slice_1/stack_1", "module_apply_default/strided_slice/stack_1"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "module_apply_default/strided_slice_4", "op": "StridedSlice", "input": ["module_apply_default/Complex", "module_apply_default/strided_slice_1/stack_1", "module_apply_default/strided_slice_4/stack_1", "module_apply_default/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/add", "op": "AddV2", "input": ["module_apply_default/Reshape_3", "module_apply_default/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_1", "op": "Mul", "input": ["module_apply_default/add", "module_apply_default/strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/add_1", "op": "AddV2", "input": ["module_apply_default/Reshape_2", "module_apply_default/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/ExpandDims", "op": "ExpandDims", "input": ["module_apply_default/add_1", "module_apply_default/CiCPaint/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/FloorMod", "op": "FloorMod", "input": ["module_apply_default/add_1", "module_apply_default/FloorMod/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/Floor", "op": "Floor", "input": ["module_apply_default/CiCPaint/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Reshape_5", "op": "Reshape", "input": ["module_apply_default/FloorMod", "module_apply_default/CiCReadout/BatchGatherND/strided_slice_1/stack_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/add", "op": "AddV2", "input": ["module_apply_default/CiCPaint/ExpandDims_1", "module_apply_default/CiCPaint/Floor"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout/Add", "op": "Add", "input": ["module_apply_default/CiCPaint/ExpandDims_1", "module_apply_default/CiCPaint/Floor"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/sub", "op": "Sub", "input": ["module_apply_default/CiCPaint/ExpandDims", "module_apply_default/CiCPaint/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/Cast", "op": "Cast", "input": ["module_apply_default/CiCPaint/add"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCReadout/sub", "op": "Sub", "input": ["module_apply_default/CiCPaint/ExpandDims", "module_apply_default/CiCReadout/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout/Cast", "op": "Cast", "input": ["module_apply_default/CiCReadout/Add"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/Abs", "op": "Abs", "input": ["module_apply_default/CiCPaint/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/add_1", "op": "AddV2", "input": ["module_apply_default/CiCPaint/Cast", "module_apply_default/CiCPaint/Reshape"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCReadout/Abs", "op": "Abs", "input": ["module_apply_default/CiCReadout/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout/add_1", "op": "AddV2", "input": ["module_apply_default/CiCPaint/Reshape", "module_apply_default/CiCReadout/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/sub_1", "op": "Sub", "input": ["module_apply_default/CiCPaint/sub_1/x", "module_apply_default/CiCPaint/Abs"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/FloorMod", "op": "FloorMod", "input": ["module_apply_default/CiCPaint/add_1", "module_apply_default/CiCPaint/strided_slice_3"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCReadout/sub_1", "op": "Sub", "input": ["module_apply_default/CiCPaint/sub_1/x", "module_apply_default/CiCReadout/Abs"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout/FloorMod", "op": "FloorMod", "input": ["module_apply_default/CiCReadout/add_1", "module_apply_default/CiCPaint/strided_slice_3"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/strided_slice_4", "op": "StridedSlice", "input": ["module_apply_default/CiCPaint/sub_1", "module_apply_default/CiCPaint/strided_slice_4/stack", "module_apply_default/CiCPaint/strided_slice_4/stack_1", "module_apply_default/CiCPaint/strided_slice_4/stack_2"], "attr": {"shrink_axis_mask": {"i": "8"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/strided_slice_5", "op": "StridedSlice", "input": ["module_apply_default/CiCPaint/sub_1", "module_apply_default/CiCPaint/strided_slice_4/stack_1", "module_apply_default/CiCPaint/strided_slice_5/stack_1", "module_apply_default/CiCPaint/strided_slice_4/stack_2"], "attr": {"shrink_axis_mask": {"i": "8"}, "begin_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/strided_slice_6", "op": "StridedSlice", "input": ["module_apply_default/CiCPaint/sub_1", "module_apply_default/CiCPaint/strided_slice_5/stack_1", "module_apply_default/CiCPaint/strided_slice_6/stack_1", "module_apply_default/CiCPaint/strided_slice_4/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "8"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}}}, {"name": "module_apply_default/CiCPaint/concat", "op": "ConcatV2", "input": ["module_apply_default/CiCPaint/Tile", "module_apply_default/CiCPaint/FloorMod", "module_apply_default/CiCPaint/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "module_apply_default/CiCReadout/strided_slice_4", "op": "StridedSlice", "input": ["module_apply_default/CiCReadout/sub_1", "module_apply_default/CiCPaint/strided_slice_4/stack", "module_apply_default/CiCPaint/strided_slice_4/stack_1", "module_apply_default/CiCPaint/strided_slice_4/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "8"}, "begin_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}}}, {"name": "module_apply_default/CiCReadout/strided_slice_5", "op": "StridedSlice", "input": ["module_apply_default/CiCReadout/sub_1", "module_apply_default/CiCPaint/strided_slice_4/stack_1", "module_apply_default/CiCPaint/strided_slice_5/stack_1", "module_apply_default/CiCPaint/strided_slice_4/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "8"}, "begin_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}}}, {"name": "module_apply_default/CiCReadout/strided_slice_6", "op": "StridedSlice", "input": ["module_apply_default/CiCReadout/sub_1", "module_apply_default/CiCPaint/strided_slice_5/stack_1", "module_apply_default/CiCPaint/strided_slice_6/stack_1", "module_apply_default/CiCPaint/strided_slice_4/stack_2"], "attr": {"shrink_axis_mask": {"i": "8"}, "begin_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout/BatchGatherND/Reshape_2", "op": "Reshape", "input": ["module_apply_default/CiCReadout/FloorMod", "module_apply_default/CiCReadout/BatchGatherND/concat_2"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/mul", "op": "Mul", "input": ["module_apply_default/CiCPaint/strided_slice_4", "module_apply_default/CiCPaint/strided_slice_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/Reshape_2", "op": "Reshape", "input": ["module_apply_default/CiCPaint/concat", "module_apply_default/CiCPaint/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCReadout/mul", "op": "Mul", "input": ["module_apply_default/CiCReadout/strided_slice_4", "module_apply_default/CiCReadout/strided_slice_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout/BatchGatherND/concat_3", "op": "ConcatV2", "input": ["module_apply_default/CiCPaint/Tile", "module_apply_default/CiCReadout/BatchGatherND/Reshape_2", "module_apply_default/CiCPaint/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "module_apply_default/CiCPaint/mul_1", "op": "Mul", "input": ["module_apply_default/CiCPaint/mul", "module_apply_default/CiCPaint/strided_slice_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout/mul_1", "op": "Mul", "input": ["module_apply_default/CiCReadout/mul", "module_apply_default/CiCReadout/strided_slice_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCPaint/Reshape_3", "op": "Reshape", "input": ["module_apply_default/CiCPaint/mul_1", "module_apply_default/CiCPaint/Reshape_3/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCPaint/ScatterNd", "op": "ScatterNd", "input": ["module_apply_default/CiCPaint/Reshape_2", "module_apply_default/CiCPaint/Reshape_3", "module_apply_default/zeros/shape_as_tensor"], "attr": {"Tindices": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/R2C3D/Complex", "op": "Complex", "input": ["module_apply_default/CiCPaint/ScatterNd", "module_apply_default/zeros"], "attr": {"T": {"type": "DT_FLOAT"}, "Tout": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/R2C3D/Reshape", "op": "Reshape", "input": ["module_apply_default/R2C3D/Complex", "module_apply_default/R2C3D/Reshape/shape"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/FFT", "op": "FFT", "input": ["module_apply_default/R2C3D/Reshape"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/R2C3D/Real", "op": "Real", "input": ["module_apply_default/R2C3D/FFT"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/R2C3D/Imag", "op": "Imag", "input": ["module_apply_default/R2C3D/FFT"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/R2C3D/Reshape_1", "op": "Reshape", "input": ["module_apply_default/R2C3D/Real", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/Reshape_2", "op": "Reshape", "input": ["module_apply_default/R2C3D/Imag", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/transpose", "op": "Transpose", "input": ["module_apply_default/R2C3D/Reshape_1", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/transpose_1", "op": "Transpose", "input": ["module_apply_default/R2C3D/Reshape_2", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/Complex_1", "op": "Complex", "input": ["module_apply_default/R2C3D/transpose", "module_apply_default/R2C3D/transpose_1"], "attr": {"Tout": {"type": "DT_COMPLEX64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/R2C3D/Reshape_3", "op": "Reshape", "input": ["module_apply_default/R2C3D/Complex_1", "module_apply_default/R2C3D/Reshape/shape"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/FFT_1", "op": "FFT", "input": ["module_apply_default/R2C3D/Reshape_3"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/R2C3D/Real_1", "op": "Real", "input": ["module_apply_default/R2C3D/FFT_1"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/R2C3D/Imag_1", "op": "Imag", "input": ["module_apply_default/R2C3D/FFT_1"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/R2C3D/Reshape_4", "op": "Reshape", "input": ["module_apply_default/R2C3D/Real_1", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/Reshape_5", "op": "Reshape", "input": ["module_apply_default/R2C3D/Imag_1", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/transpose_2", "op": "Transpose", "input": ["module_apply_default/R2C3D/Reshape_4", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/transpose_3", "op": "Transpose", "input": ["module_apply_default/R2C3D/Reshape_5", "module_apply_default/R2C3D/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/R2C3D/Complex_2", "op": "Complex", "input": ["module_apply_default/R2C3D/transpose_2", "module_apply_default/R2C3D/transpose_3"], "attr": {"T": {"type": "DT_FLOAT"}, "Tout": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/R2C3D/Reshape_6", "op": "Reshape", "input": ["module_apply_default/R2C3D/Complex_2", "module_apply_default/R2C3D/Reshape/shape"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/FFT_2", "op": "FFT", "input": ["module_apply_default/R2C3D/Reshape_6"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/R2C3D/Real_2", "op": "Real", "input": ["module_apply_default/R2C3D/FFT_2"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/R2C3D/Imag_2", "op": "Imag", "input": ["module_apply_default/R2C3D/FFT_2"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/R2C3D/Reshape_7", "op": "Reshape", "input": ["module_apply_default/R2C3D/Real_2", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/Reshape_8", "op": "Reshape", "input": ["module_apply_default/R2C3D/Imag_2", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/transpose_4", "op": "Transpose", "input": ["module_apply_default/R2C3D/Reshape_7", "module_apply_default/R2C3D/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/R2C3D/transpose_5", "op": "Transpose", "input": ["module_apply_default/R2C3D/Reshape_8", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/R2C3D/Complex_3", "op": "Complex", "input": ["module_apply_default/R2C3D/transpose_4", "module_apply_default/R2C3D/transpose_5"], "attr": {"T": {"type": "DT_FLOAT"}, "Tout": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/mul_2", "op": "Mul", "input": ["module_apply_default/R2C3D/Complex_3", "module_apply_default/strided_slice_2"], "attr": {"T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/mul_3", "op": "Mul", "input": ["module_apply_default/R2C3D/Complex_3", "module_apply_default/strided_slice_3"], "attr": {"T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/mul_4", "op": "Mul", "input": ["module_apply_default/R2C3D/Complex_3", "module_apply_default/strided_slice_4"], "attr": {"T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D/Reshape", "op": "Reshape", "input": ["module_apply_default/mul_2", "module_apply_default/R2C3D/Reshape/shape"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/Reshape", "op": "Reshape", "input": ["module_apply_default/mul_3", "module_apply_default/R2C3D/Reshape/shape"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/Reshape", "op": "Reshape", "input": ["module_apply_default/mul_4", "module_apply_default/R2C3D/Reshape/shape"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D/IFFT", "op": "IFFT", "input": ["module_apply_default/C2R3D/Reshape"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_1/IFFT", "op": "IFFT", "input": ["module_apply_default/C2R3D_1/Reshape"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_2/IFFT", "op": "IFFT", "input": ["module_apply_default/C2R3D_2/Reshape"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D/Real", "op": "Real", "input": ["module_apply_default/C2R3D/IFFT"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D/Imag", "op": "Imag", "input": ["module_apply_default/C2R3D/IFFT"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_1/Real", "op": "Real", "input": ["module_apply_default/C2R3D_1/IFFT"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_1/Imag", "op": "Imag", "input": ["module_apply_default/C2R3D_1/IFFT"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_2/Real", "op": "Real", "input": ["module_apply_default/C2R3D_2/IFFT"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D_2/Imag", "op": "Imag", "input": ["module_apply_default/C2R3D_2/IFFT"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D/Reshape_1", "op": "Reshape", "input": ["module_apply_default/C2R3D/Real", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D/Reshape_2", "op": "Reshape", "input": ["module_apply_default/C2R3D/Imag", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/Reshape_1", "op": "Reshape", "input": ["module_apply_default/C2R3D_1/Real", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/Reshape_2", "op": "Reshape", "input": ["module_apply_default/C2R3D_1/Imag", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/Reshape_1", "op": "Reshape", "input": ["module_apply_default/C2R3D_2/Real", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/Reshape_2", "op": "Reshape", "input": ["module_apply_default/C2R3D_2/Imag", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D/transpose", "op": "Transpose", "input": ["module_apply_default/C2R3D/Reshape_1", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D/transpose_1", "op": "Transpose", "input": ["module_apply_default/C2R3D/Reshape_2", "module_apply_default/R2C3D/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D_1/transpose", "op": "Transpose", "input": ["module_apply_default/C2R3D_1/Reshape_1", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/transpose_1", "op": "Transpose", "input": ["module_apply_default/C2R3D_1/Reshape_2", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/transpose", "op": "Transpose", "input": ["module_apply_default/C2R3D_2/Reshape_1", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/transpose_1", "op": "Transpose", "input": ["module_apply_default/C2R3D_2/Reshape_2", "module_apply_default/R2C3D/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D/Complex", "op": "Complex", "input": ["module_apply_default/C2R3D/transpose", "module_apply_default/C2R3D/transpose_1"], "attr": {"Tout": {"type": "DT_COMPLEX64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D_1/Complex", "op": "Complex", "input": ["module_apply_default/C2R3D_1/transpose", "module_apply_default/C2R3D_1/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tout": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_2/Complex", "op": "Complex", "input": ["module_apply_default/C2R3D_2/transpose", "module_apply_default/C2R3D_2/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tout": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D/Reshape_3", "op": "Reshape", "input": ["module_apply_default/C2R3D/Complex", "module_apply_default/R2C3D/Reshape/shape"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/Reshape_3", "op": "Reshape", "input": ["module_apply_default/C2R3D_1/Complex", "module_apply_default/R2C3D/Reshape/shape"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/Reshape_3", "op": "Reshape", "input": ["module_apply_default/C2R3D_2/Complex", "module_apply_default/R2C3D/Reshape/shape"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D/IFFT_1", "op": "IFFT", "input": ["module_apply_default/C2R3D/Reshape_3"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_1/IFFT_1", "op": "IFFT", "input": ["module_apply_default/C2R3D_1/Reshape_3"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_2/IFFT_1", "op": "IFFT", "input": ["module_apply_default/C2R3D_2/Reshape_3"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D/Real_1", "op": "Real", "input": ["module_apply_default/C2R3D/IFFT_1"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D/Imag_1", "op": "Imag", "input": ["module_apply_default/C2R3D/IFFT_1"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_1/Real_1", "op": "Real", "input": ["module_apply_default/C2R3D_1/IFFT_1"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D_1/Imag_1", "op": "Imag", "input": ["module_apply_default/C2R3D_1/IFFT_1"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D_2/Real_1", "op": "Real", "input": ["module_apply_default/C2R3D_2/IFFT_1"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_2/Imag_1", "op": "Imag", "input": ["module_apply_default/C2R3D_2/IFFT_1"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D/Reshape_4", "op": "Reshape", "input": ["module_apply_default/C2R3D/Real_1", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D/Reshape_5", "op": "Reshape", "input": ["module_apply_default/C2R3D/Imag_1", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/Reshape_4", "op": "Reshape", "input": ["module_apply_default/C2R3D_1/Real_1", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/Reshape_5", "op": "Reshape", "input": ["module_apply_default/C2R3D_1/Imag_1", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/Reshape_4", "op": "Reshape", "input": ["module_apply_default/C2R3D_2/Real_1", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/Reshape_5", "op": "Reshape", "input": ["module_apply_default/C2R3D_2/Imag_1", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D/transpose_2", "op": "Transpose", "input": ["module_apply_default/C2R3D/Reshape_4", "module_apply_default/R2C3D/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D/transpose_3", "op": "Transpose", "input": ["module_apply_default/C2R3D/Reshape_5", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/transpose_2", "op": "Transpose", "input": ["module_apply_default/C2R3D_1/Reshape_4", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/transpose_3", "op": "Transpose", "input": ["module_apply_default/C2R3D_1/Reshape_5", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/transpose_2", "op": "Transpose", "input": ["module_apply_default/C2R3D_2/Reshape_4", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/transpose_3", "op": "Transpose", "input": ["module_apply_default/C2R3D_2/Reshape_5", "module_apply_default/R2C3D/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D/Complex_1", "op": "Complex", "input": ["module_apply_default/C2R3D/transpose_2", "module_apply_default/C2R3D/transpose_3"], "attr": {"T": {"type": "DT_FLOAT"}, "Tout": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_1/Complex_1", "op": "Complex", "input": ["module_apply_default/C2R3D_1/transpose_2", "module_apply_default/C2R3D_1/transpose_3"], "attr": {"T": {"type": "DT_FLOAT"}, "Tout": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_2/Complex_1", "op": "Complex", "input": ["module_apply_default/C2R3D_2/transpose_2", "module_apply_default/C2R3D_2/transpose_3"], "attr": {"T": {"type": "DT_FLOAT"}, "Tout": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D/Reshape_6", "op": "Reshape", "input": ["module_apply_default/C2R3D/Complex_1", "module_apply_default/R2C3D/Reshape/shape"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/Reshape_6", "op": "Reshape", "input": ["module_apply_default/C2R3D_1/Complex_1", "module_apply_default/R2C3D/Reshape/shape"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/Reshape_6", "op": "Reshape", "input": ["module_apply_default/C2R3D_2/Complex_1", "module_apply_default/R2C3D/Reshape/shape"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D/IFFT_2", "op": "IFFT", "input": ["module_apply_default/C2R3D/Reshape_6"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_1/IFFT_2", "op": "IFFT", "input": ["module_apply_default/C2R3D_1/Reshape_6"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_2/IFFT_2", "op": "IFFT", "input": ["module_apply_default/C2R3D_2/Reshape_6"], "attr": {"Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D/Real_2", "op": "Real", "input": ["module_apply_default/C2R3D/IFFT_2"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D/Imag_2", "op": "Imag", "input": ["module_apply_default/C2R3D/IFFT_2"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_1/Real_2", "op": "Real", "input": ["module_apply_default/C2R3D_1/IFFT_2"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D_1/Imag_2", "op": "Imag", "input": ["module_apply_default/C2R3D_1/IFFT_2"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D_2/Real_2", "op": "Real", "input": ["module_apply_default/C2R3D_2/IFFT_2"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_2/Imag_2", "op": "Imag", "input": ["module_apply_default/C2R3D_2/IFFT_2"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D/Reshape_7", "op": "Reshape", "input": ["module_apply_default/C2R3D/Real_2", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D/Reshape_8", "op": "Reshape", "input": ["module_apply_default/C2R3D/Imag_2", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/Reshape_7", "op": "Reshape", "input": ["module_apply_default/C2R3D_1/Real_2", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/Reshape_8", "op": "Reshape", "input": ["module_apply_default/C2R3D_1/Imag_2", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/Reshape_7", "op": "Reshape", "input": ["module_apply_default/C2R3D_2/Real_2", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_2/Reshape_8", "op": "Reshape", "input": ["module_apply_default/C2R3D_2/Imag_2", "module_apply_default/R2C3D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D/transpose_4", "op": "Transpose", "input": ["module_apply_default/C2R3D/Reshape_7", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D/transpose_5", "op": "Transpose", "input": ["module_apply_default/C2R3D/Reshape_8", "module_apply_default/R2C3D/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "module_apply_default/C2R3D_1/transpose_4", "op": "Transpose", "input": ["module_apply_default/C2R3D_1/Reshape_7", "module_apply_default/R2C3D/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D_1/transpose_5", "op": "Transpose", "input": ["module_apply_default/C2R3D_1/Reshape_8", "module_apply_default/R2C3D/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D_2/transpose_4", "op": "Transpose", "input": ["module_apply_default/C2R3D_2/Reshape_7", "module_apply_default/R2C3D/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D_2/transpose_5", "op": "Transpose", "input": ["module_apply_default/C2R3D_2/Reshape_8", "module_apply_default/R2C3D/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D/Complex_2", "op": "Complex", "input": ["module_apply_default/C2R3D/transpose_4", "module_apply_default/C2R3D/transpose_5"], "attr": {"T": {"type": "DT_FLOAT"}, "Tout": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_1/Complex_2", "op": "Complex", "input": ["module_apply_default/C2R3D_1/transpose_4", "module_apply_default/C2R3D_1/transpose_5"], "attr": {"Tout": {"type": "DT_COMPLEX64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D_2/Complex_2", "op": "Complex", "input": ["module_apply_default/C2R3D_2/transpose_4", "module_apply_default/C2R3D_2/transpose_5"], "attr": {"Tout": {"type": "DT_COMPLEX64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D/Real_3", "op": "Real", "input": ["module_apply_default/C2R3D/Complex_2"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/C2R3D_1/Real_3", "op": "Real", "input": ["module_apply_default/C2R3D_1/Complex_2"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tout": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/C2R3D_2/Real_3", "op": "Real", "input": ["module_apply_default/C2R3D_2/Complex_2"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "module_apply_default/CiCReadout/BatchGatherND/GatherNd", "op": "GatherNd", "input": ["module_apply_default/C2R3D/Real_3", "module_apply_default/CiCReadout/BatchGatherND/concat_3"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout_1/BatchGatherND/GatherNd", "op": "GatherNd", "input": ["module_apply_default/C2R3D_1/Real_3", "module_apply_default/CiCReadout/BatchGatherND/concat_3"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout_2/BatchGatherND/GatherNd", "op": "GatherNd", "input": ["module_apply_default/C2R3D_2/Real_3", "module_apply_default/CiCReadout/BatchGatherND/concat_3"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout/Mul_2", "op": "Mul", "input": ["module_apply_default/CiCReadout/BatchGatherND/GatherNd", "module_apply_default/CiCReadout/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout_1/Mul_2", "op": "Mul", "input": ["module_apply_default/CiCReadout/mul_1", "module_apply_default/CiCReadout_1/BatchGatherND/GatherNd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout_2/Mul_2", "op": "Mul", "input": ["module_apply_default/CiCReadout/mul_1", "module_apply_default/CiCReadout_2/BatchGatherND/GatherNd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout/Sum", "op": "Sum", "input": ["module_apply_default/CiCReadout/Mul_2", "module_apply_default/CiCPaint/concat/axis"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/CiCReadout_1/Sum", "op": "Sum", "input": ["module_apply_default/CiCReadout_1/Mul_2", "module_apply_default/CiCPaint/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "module_apply_default/CiCReadout_2/Sum", "op": "Sum", "input": ["module_apply_default/CiCReadout_2/Mul_2", "module_apply_default/CiCPaint/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "module_apply_default/stack", "op": "Pack", "input": ["module_apply_default/CiCReadout/Sum", "module_apply_default/CiCReadout_1/Sum", "module_apply_default/CiCReadout_2/Sum"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "axis": {"i": "2"}}}, {"name": "module_apply_default/mul_6", "op": "Mul", "input": ["module_apply_default/mul_5", "module_apply_default/stack"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/add_2", "op": "AddV2", "input": ["module_apply_default/Reshape_4", "module_apply_default/mul_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_7", "op": "Mul", "input": ["module_apply_default/add_2", "module_apply_default/strided_slice_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Reshape_7", "op": "Reshape", "input": ["module_apply_default/add_2", "module_apply_default/CiCReadout/BatchGatherND/strided_slice_1/stack_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_3", "op": "AddV2", "input": ["module_apply_default/add", "module_apply_default/mul_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Reshape_6", "op": "Reshape", "input": ["module_apply_default/add_3", "module_apply_default/CiCReadout/BatchGatherND/strided_slice_1/stack_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}], "versions": {"minConsumer": 12}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "module_apply_default/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/Reshape_2/shape", "shape": [3], "dtype": "int32"}, {"name": "module_apply_default/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/zeros/shape_as_tensor", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/CiCPaint/strided_slice_3", "shape": [], "dtype": "int32"}, {"name": "module_apply_default/CiCPaint/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "module_apply_default/CiCPaint/ExpandDims_1", "shape": [1, 1, 8, 3], "dtype": "float32"}, {"name": "module_apply_default/CiCPaint/sub_1/x", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/CiCPaint/strided_slice_4/stack", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/CiCPaint/strided_slice_4/stack_1", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/CiCPaint/strided_slice_4/stack_2", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/CiCPaint/strided_slice_5/stack_1", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/mul_5", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/CiCPaint/strided_slice_6/stack_1", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/CiCPaint/Reshape", "shape": [1, 1, 3], "dtype": "int32"}, {"name": "module_apply_default/CiCPaint/Tile", "shape": [1, 4096, 8, 1], 